chore: replaced architecture diagram in README
